<a href="https://colab.research.google.com/github/liqzan/github-slideshow/blob/master/Finding_and_fixing_missing_values_from_data_set.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Missing Values example**

In [ ]:
import pandas as pd
import numpy as np
z1 = [1,np.nan, np.nan,4,5,np.nan,7,np.nan]
z2 = [1,1,1,1,2,2,2,2]
df1 = pd.DataFrame({'Cricket': z1,
                    'Tennis' : z2})

In [ ]:
df1.to_csv("/content/drive/My Drive/ML Insternship/missing_eg.csv")

In [ ]:
df1

   Cricket  Tennis
0      1.0       1
1      NaN       1
2      NaN       1
3      4.0       1
4      5.0       2
5      NaN       2
6      7.0       2
7      NaN       2

In [ ]:
#Filling with zero
df1.fillna(value = 2)

   Cricket  Tennis
0      1.0       1
1      2.0       1
2      2.0       1
3      4.0       1
4      5.0       2
5      2.0       2
6      7.0       2
7      2.0       2

In [ ]:
df1['Cricket'].mean()

4.25

In [ ]:
df1.fillna(value = 4.5)

   Cricket  Tennis
0      1.0       1
1      4.5       1
2      4.5       1
3      4.0       1
4      5.0       2
5      4.5       2
6      7.0       2
7      4.5       2

In [ ]:
df1["Cricket"]= df1["Cricket"].fillna(value = 3.5)
df1

   Cricket  Tennis
0      1.0       1
1      3.5       1
2      3.5       1
3      4.0       1
4      5.0       2
5      3.5       2
6      7.0       2
7      3.5       2

In [ ]:
df1

   Cricket  Tennis
0      1.0       1
1      NaN       1
2      NaN       1
3      4.0       1
4      5.0       2
5      NaN       2
6      7.0       2
7      NaN       2

In [ ]:
df1['Cricket'] = df1["Cricket"].fillna(value = df1["Cricket"].mean())

In [ ]:
df1

   Cricket  Tennis
0      1.0       1
1      NaN       1
2      NaN       1
3      4.0       1
4      5.0       2
5      NaN       2
6      7.0       2
7      NaN       2

In [ ]:
df1['Cricket'].fillna(df1.groupby(['Tennis'])['Cricket'].transform(np.mean),inplace=True)
df1

   Cricket  Tennis
0      1.0       1
1      2.5       1
2      2.5       1
3      4.0       1
4      5.0       2
5      6.0       2
6      7.0       2
7      6.0       2

In [ ]:
import pandas as pd
import numpy as np
z1 = [1,np.nan, np.nan,4,5,np.nan,7,np.nan]
z2 = [1,1,1,1,2,2,2,2]
z3 = [2,2,3,3,4,4,5,5]
df1 = pd.DataFrame({'Cricket': z1,
                    'Tennis' : z2,
                    "Basketball": z3})

In [ ]:
df1

   Cricket  Tennis  Basketball
0      1.0       1           2
1      NaN       1           2
2      NaN       1           3
3      4.0       1           3
4      5.0       2           4
5      NaN       2           4
6      7.0       2           5
7      NaN       2           5

In [ ]:
df1['Cricket'].fillna(df1.groupby(['Basketball'])['Cricket'].transform(np.mean),inplace=True)
df1

   Cricket  Tennis  Basketball
0      1.0       1           2
1      1.0       1           2
2      4.0       1           3
3      4.0       1           3
4      5.0       2           4
5      5.0       2           4
6      7.0       2           5
7      7.0       2           5